RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_esc.h
/* Define the ESC on chip bus bit position and its register index offset */
#define ESC_REGIDX_BIT(regidx, bitpos)    (((uint32_t)(regidx) << 6U) | (uint32_t)(bitpos))
#define ESC_REG_VAL(periph)               (REG32(ESC + ((uint32_t)(periph) >> 6U)))
#define ESC_BIT_POS(val)                  ((uint32_t)(val) & 0x1FU)


#define ESC_MII_MNG_CTL_OFFSET             0x0510U                                  /*!< ESC MII Management Control register offset */
#define ESC_MII_MNG_STAT_OFFSET            0x0511U                                  /*!< ESC MII Management Status register offset */
#define ESC_PHY_ADDR_OFFSET                0x0512U                                  /*!< ESC PHY Address register offset */
#define ESC_PHY_REG_ADDR_OFFSET            0x0513U                                  /*!< ESC PHY Register Address register offset */
#define ESC_PHY_DATA_OFFSET                0x0514U                                  /*!< ESC PHY Data register offset */
#define MIIM_PDI_ACC_STAT_OFFSET           0x0517U                                  /*!< MII Management PDI Access State register offset */
#define READ_PHY_CMD                       0x1U                                     /*!< read phy command */
#define WRITE_PHY_CMD                      0x2U                                     /*!< write phy command */
#define WRITE_PHY_ENABLE                   0x1U                                     /*!< write phy enable */

#define PDI_ACCESS_MII_MANAGEMENT_ENABLE   0x1U                                     /*!< PDI has access to MII management */

/* Register address offsets for PDI access */
#define ESC_RST_PDI_OFFSET                 0x0041U                                  /*!< ESC Reset PDI register offset */
#define PDI_RESET_R                        0x52U                                    /*!< reset command R */
#define PDI_RESET_E                        0x45U                                    /*!< reset command E */
#define PDI_RESET_S                        0x53U                                    /*!< reset command S */

/* ESC on chip bus interrupt enable or disable*/
typedef enum {
    ESC_I2CIE             = ESC_REGIDX_BIT(ESC_CTL_REG_OFFSET, 20U),                /*!< Internal I2C overrun interrupt */
    ESC_IVIE              = ESC_REGIDX_BIT(ESC_CTL_REG_OFFSET, 22U),                /*!< CCTL size & addr illegal value interrupt */
    ESC_WEIE              = ESC_REGIDX_BIT(ESC_CTL_REG_OFFSET, 24U),                /*!< write error interrupt */
    ESC_TOIE              = ESC_REGIDX_BIT(ESC_CTL_REG_OFFSET, 26U),                /*!< time out interrupt */
    ESC_WDLIE             = ESC_REGIDX_BIT(ESC_CTL_REG_OFFSET, 28U),                /*!< write data lost interrupt */
} esc_on_chip_bus_interrupt_enum;

/* ESC on chip bus flags */
typedef enum {
    ESC_FLAG_I2CF          = ESC_REGIDX_BIT(ESC_CTL_REG_OFFSET, 21U),                /*!< Internal I2C communication error flag */
    ESC_FLAG_IVF           = ESC_REGIDX_BIT(ESC_CTL_REG_OFFSET, 23U),                /*!< CCTL size & addr illegal value flag */
    ESC_FLAG_WEF           = ESC_REGIDX_BIT(ESC_CTL_REG_OFFSET, 25U),                /*!< write error flag */
    ESC_FLAG_TOF           = ESC_REGIDX_BIT(ESC_CTL_REG_OFFSET, 27U),                /*!< time out flag */
    ESC_FLAG_WDLF          = ESC_REGIDX_BIT(ESC_CTL_REG_OFFSET, 29U),                /*!< write data lost flag */
} esc_on_chip_bus_flag_enum;

/* esc pdi direct read esc core register */
void pdi_direct_read_reg(uint8_t readbuffer[], uint16_t addr, uint16_t count);
/* esc pdi direct write esc core register */
void pdi_direct_write_reg(uint8_t writebuffer[], uint16_t addr, uint16_t count);
/* esc pdi direct read esc pdram */
void pdi_direct_read_pdram(uint8_t readbuffer[], uint16_t addr, uint16_t count);
/* esc pdi direct write esc pdram */
void pdi_direct_write_pdram(uint8_t writebuffer[], uint16_t addr, uint16_t count);
/* esc pdi reset */
void pdi_reset(void);
/* esc pdi read phy register */
uint16_t pdi_phy_read(uint8_t phy_addr, uint8_t phy_reg_addr);
/* esc pdi write phy register */
void pdi_phy_write(uint8_t phy_addr, uint8_t phy_reg_addr, uint16_t phy_data);
/* esc brp enable */
void esc_brp_enable(void);
/* esc brp disable */
void esc_brp_disable(void);
/* esc time out enable */
void esc_timeout_enable(void);
/* esc time out disable */
void esc_timeout_disable(void);
/* esc time out counter */
void esc_timeout_cnt(uint32_t cnt);
/* esc enable the on_chip_bus interrupt */
void esc_interrupt_enable(esc_on_chip_bus_interrupt_enum interrupt);
/* esc disable the on_chip_bus interrupt */
void esc_interrupt_disable(esc_on_chip_bus_interrupt_enum interrupt);
/* esc get esc on_chip_bus flags */
FlagStatus esc_interrupt_flag_get(esc_on_chip_bus_flag_enum int_flag);
/* esc clear esc on_chip_bus flags */
void esc_interrupt_flag_clear(esc_on_chip_bus_flag_enum int_flag);

#endif /* GD32H77X_78X_ESC_H */
